Enterprise_Serivces/Prod/Bronze2/CSLAssociationService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/association/contracts/2010/05/IAssociationService/GetAssociationByHandle</wsa:Action><wsa:MessageID>uuid:f23bcc82-839d-4d73-bfd4-24085cbd804f</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslassociationserviceqa1.testgs.pvt/AssociationService.svc</wsa:To></soap:Header><soap:Body><GetAssociationByHandle xmlns="http://www.gamestop.com/services/csl/association/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><AssociationHandle xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">test</AssociationHandle><DistinguishingFactor xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">test</DistinguishingFactor></request></GetAssociationByHandle></soap:Body></soap:Envelope>